[
    {
        "link": "",
        "content": "There's something reassuring about the fact that when discussing tech monopolies we're worried about four different companies (Apple, Google, Facebook, Amazon). They could still be monopolistic, especially in their different areas of strength, but there's inherent value in the fact that they have to compete against each other.",
        "id": 14,
        "publish_date": "2019-12-21T00:00:00Z",
        "show_date": true
    },
    {
        "link": "",
        "content": "There’s an interesting analogy between leading teams/corporations and designing software. You’d think that you can just tell people (programs) what to do and it would be easy but it’s hard to understand precisely what you want to achieve, let alone articulate it. Therefore clear thinking and clear articulating are very valuable. Both leaders and great software engineers are excellent at understanding what they want to achieve and at explaining how they plan to achieve it.",
        "id": 13,
        "publish_date": "2019-12-21T00:00:00Z",
        "show_date": true
    },
    {
        "link": "",
        "content": "How can stock market returns be so much higher than GDP growth? Is it a ponzi? The answer appears to be the following: If a company is worth $100 million in real USD and its revenue is $20m and profit is $5m, and it doesn’t grow in real terms, it can provide a steady 5% rate of return through dividends without requiring any GDP growth. If GDP growth is ~3% and the company grows accordingly (same share of GDP) then it’s likely to achieve something closer to 8% returns. The company needs to actually sustain profits over time and not get squeezed by competitors but if you average across many companies then some decline while others take their place.",
        "id": 12,
        "publish_date": "2019-12-21T00:00:00Z",
        "show_date": true
    },
    {
        "link": "",
        "content": "I wonder if autonomous trucks will lead to more trucks being manufactured (more demand) or less (higher utilization). Intuition says more but not sure.",
        "id": 11,
        "publish_date": "2019-12-18T00:00:00Z",
        "show_date": true
    },
    {
        "link": "",
        "content": "Within 10 years we'll probably have a conversational AI that humans can befriend. Once that happens, it'll be immoral to delete the model. That's pretty wild.",
        "id": 10,
        "publish_date": "2019-12-18T00:00:00Z",
        "show_date": true
    },
    {
        "link": "",
        "content": "Bearish on Nvidia as a company. Seems much of their AI products will be unbundled and disrupted.",
        "id": 9,
        "publish_date": "2019-12-15T00:00:00Z",
        "show_date": true
    },
    {
        "link": "",
        "content": "It's funny how people will crowd into a big auditorium to hear some big shot talk but most would never take the same time to watch a YouTube video of the same person or read an in-depth interview describing that person's world view, although that usually has much higher leverage.",
        "id": 8,
        "publish_date": "2019-12-15T00:00:00Z",
        "show_date": true
    },
    {
        "link": "",
        "content": "Having great tools is very important to being productive. This is true of software, your body, and many other things.",
        "id": 7,
        "publish_date": "2019-12-15T00:00:00Z",
        "show_date": true
    },
    {
        "link": "",
        "content": "An excellent Benedict Evans insight - we're sometimes worried about AI that works badly (e.g. bias in employment algorithms, bad parole decisions, etc) and other times worried about AI that works well (e.g. China using facial recognition on minorities, hyper-targeting of ads to specific people, etc)",
        "id": 6,
        "publish_date": "2019-12-09T00:00:00Z",
        "show_date": true
    },
    {
        "link": "",
        "content": "Too many books don't have an Audible version. Makes me read them much later.",
        "id": 5,
        "publish_date": "2019-12-05T00:00:00Z",
        "show_date": true
    },
    {
        "link": "",
        "content": "It's important to be proactive vs reactive. That's one reason why a news/social media fast is a good idea - you engage at specific times instead of just aimlessly browsing random stuff. Most of us have tons of phone/computer habits that we don't even notice. They cost us a lot of time, especially since once you start it's easy to get sucked in.",
        "id": 4,
        "publish_date": "2019-12-04T00:00:00Z",
        "show_date": true
    },
    {
        "link": "",
        "content": "Thinking about the GAFA companies. At $872bn, Amazon is way undervalued. My bet is that in 10 years, AWS and the logistics/retail business will each be worth more than that. At $911bn, Google is also undervalued but to a lesser extent. YouTube is so big that it alone should be at least double Netflix (currently $133bn). Waymo will be worth a lot. And then they have Maps, Chrome, Android, Gmail, and of course Search. Apple is killing it in wearables and has a giant head start in AR. Probably won't double in 10 years but my bet is >$2 trillion, vs $1.18 trillion now. Facebook will make a ton of money in the 2020s but I'd be surprised if it ever passed $1 trillion (now $567bn).",
        "id": 3,
        "publish_date": "2019-12-04T00:00:00Z",
        "show_date": true
    },
    {
        "link": "",
        "content": "String beans with rice is always more satiating than you originally think.\n",
        "id": 2,
        "publish_date": "2019-12-04T00:00:00Z",
        "show_date": true
    },
    {
        "link": "",
        "content": "Strange that Apple has $210 billion in cash but still sells bonds. I guess it's because they think reinvesting that money in Apple stock will give them a higher return. Still don't see why they would need so much cash.",
        "id": 1,
        "publish_date": "2019-11-30T00:00:00Z",
        "show_date": true
    },
    {
        "link": "",
        "content": "It's unclear when there will be a recession but it does appear that the stock market's upside is smaller than it's downside, a fact that may be guiding high saving rates. My bet is on stagnation without a crash. If true, in the early 2020s investing in top tier corporate bonds will have a better risk/reward profile than stocks or government bonds. This is especially true when investing in companies that are very likely to survive a crash (Telecoms, Big Tech, Defense Contractors, Airlines, Credit Card Companies, and some more).",
        "id": 0,
        "publish_date": "2019-11-28T00:00:00Z",
        "show_date": true
    }
]